GREETING_TEXT = '''
Привет 👋 
Меня зовут Ситик! 
Петербург скрывает от тебя много тайн!
Хотел бы их разгадать? Предлагаю тебе отправится в путешествие по культурной столице России в новом формате. 
 
▪️ Уникальные путешествия и квесты, которые можно получить только через наш клуб. 
▪️ Онлайн формат для индивидуальных прогулок без группы, гида и привязки к дате.
 
Скорее жми «НАЧАТЬ ПРИКЛЮЧЕНИЕ✨» 
'''

ADDITIONAL_TEXT = ("Санкт-Петербург был основан Петром I в 1703 году. "
                   "Он назвал этот город в честь своего покровителя, апостола Петра. \n\n"
                   "С самого начала Санкт-Петербург стал центром культуры, науки и искусства. "
                   "Город пропитан тайнами и мифами, которые складывались множество столетий. \n\n"
                   "Если ты хочешь разгадать тайны Санкт-Петербурга, "
                   "то наши путешествия - это именно то, что тебе нужно. "
                   "Мы предлагаем уникальную возможность познакомиться с историей и культурой города, "
                   "а также увидеть все его главные достопримечательности, разгадать загадки, "
                   "открыть множество его секретов. \n\n"
                   "Кроме того, наша экскурсия - это отличная возможность попробовать новый формат путешествий: \n\n"
                   "▪️ Тебе нужен только смартфон и наушники. \n"
                   "▪️ Ты можешь проходить маршрут в несколько этапов, в собственном ритме, "
                   "останавливать и продолжать экскурсию в любой удобный момент. \n"
                   "▪️ Ты не привязан к группе и можешь наслаждаться красотами города в индивидуальном формате. \n\n"
                   "Путешествуя с SAINT CITY, ты получишь незабываемые впечатления "
                   "и прекрасно проведешь время в одном из самых красивых городов мира!")

MAIN_MENU_TEXT = "ГЛАВНОЕ МЕНЮ"
TARIFFS_TEXT = "Тарифы"
UNKNOWN_COMMAND_TEXT = "непонял тебя..."

# Buttons
MAIN_MENU_BUTTON_TEXT = "В главное меню"
START_ADVENTURE_BUTTON_TEXT = "НАЧАТЬ ПРИКЛЮЧЕНИЕ✨"
ADDITIONAL_BUTTON_TEXT = "Подробнее"
TARIFFS_BUTTON_TEXT = "Тарифы"
CHOOSE_EXCURSION_BUTTON_TEXT = "Выбрать экскурсию"
CHOOSE_OTHER_EXCURSION_BUTTON_TEXT = "Другие экскурсии"
BEGIN_BUTTON_TEXT = "Начать экскурсию"
MY_STATUS_BUTTON_TEXT = "Узнать мой тариф"

NO_TARIFF_TEXT = "Вы ещё не преобретали никакой тариф. Вы можете сделать это через главное меню!"
TARIFF_EXPIRES_TEXT = "Ваш тариф просрочен. Чтобы получить доступ к экскурсиям, преобретите новый тариф"
TARIFF_INFO_TEXT_ARR = ["▪️ Ваш тариф: ", "\n▪️ Срок действия тарифа: до ", "\n▪️ Экскурсий осталось: "]

TARIFF_ONE_TEXT = "Любитель"
TARIFF_TWO_TEXT = "Турист"
TARIFF_THREE_TEXT = "Гуру"

TARIFFS_ARR = [TARIFF_ONE_TEXT, TARIFF_TWO_TEXT, TARIFF_THREE_TEXT]

WRONG_QUIZ_ANSWER_TEXT = "Неправильно. Попробуй ещё раз!"
RIGHT_QUIZ_ANSWER_TEXT = "Всё правильно, молодец!"

STOP_EXCURSION_TEXT = ("Хорошо, я сохранил твой прогресс по экскурсии. "
                       "Ты можешь вернуться и закончить экскурсию в любой момент!")
